#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/vishnukap_learning/s3-website/runs/run-ZaxCeEsWXXosNxU3

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:805586991204:certificate/88f06708-4f66-4a62-b348-b98d782cc35c]
aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_s3_bucket.s3_static_website: Refreshing state... [id=www.visham.org]
aws_s3_bucket_policy.allow_access: Refreshing state... [id=www.visham.org]
aws_s3_bucket_website_configuration.s3_static_website: Refreshing state... [id=www.visham.org]
aws_s3_object.object["1"]: Refreshing state... [id=css/main.073c9b0a.css.map]
aws_s3_bucket_ownership_controls.s3_static_website_object_ownership: Refreshing state... [id=www.visham.org]
aws_s3_object.object["6"]: Refreshing state... [id=js/main.1af3e22d.js.map]
aws_s3_bucket_public_access_block.s3_static_website_pa_block: Refreshing state... [id=www.visham.org]
aws_s3_object.object["4"]: Refreshing state... [id=js/main.1af3e22d.js]
aws_s3_object.object["7"]: Refreshing state... [id=media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg]
aws_s3_object.object["0"]: Refreshing state... [id=css/main.073c9b0a.css]
aws_s3_object.object["2"]: Refreshing state... [id=js/787.a3103ff7.chunk.js]
aws_s3_object.object["5"]: Refreshing state... [id=js/main.1af3e22d.js.LICENSE.txt]
aws_s3_object.object["3"]: Refreshing state... [id=js/787.a3103ff7.chunk.js.map]
aws_s3_object.files["manifest.json"]: Refreshing state... [id=manifest.json]
aws_s3_object.files["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
aws_s3_object.files["favicon.ico"]: Refreshing state... [id=favicon.ico]
aws_s3_object.files["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.files["logo192.png"]: Refreshing state... [id=logo192.png]
aws_s3_object.files["logo512.png"]: Refreshing state... [id=logo512.png]
aws_s3_object.files["robots.txt"]: Refreshing state... [id=robots.txt]
aws_s3_bucket_acl.s3_static_website_acl: Refreshing state... [id=www.visham.org,public-read]
aws_cloudfront_distribution.cdn: Refreshing state... [id=E17YUM5QUJCVXF]
aws_route53_record.dns: Refreshing state... [id=Z02024842F73WIP3EA0PB_visham.org_A]
aws_route53_record.www: Refreshing state... [id=Z02024842F73WIP3EA0PB_www.visham.org_A]
aws_s3_object.object["6"]: Drift detected (update)
aws_s3_object.object["7"]: Drift detected (update)
aws_s3_object.object["0"]: Drift detected (update)
aws_s3_object.object["1"]: Drift detected (update)
aws_s3_object.object["2"]: Drift detected (update)
aws_s3_object.object["3"]: Drift detected (update)
aws_s3_object.object["4"]: Drift detected (update)
aws_s3_object.object["5"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_object.object["0"] must be replaced
-/+ resource "aws_s3_object" "object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "css/main.073c9b0a.css" -> (known after apply)
      ~ key                    = "css/main.073c9b0a.css" -> "static/css/main.073c9b0a.css" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_s3_object.object["1"] must be replaced
-/+ resource "aws_s3_object" "object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "css/main.073c9b0a.css.map" -> (known after apply)
      ~ key                    = "css/main.073c9b0a.css.map" -> "static/css/main.073c9b0a.css.map" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_s3_object.object["2"] must be replaced
-/+ resource "aws_s3_object" "object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "js/787.a3103ff7.chunk.js" -> (known after apply)
      ~ key                    = "js/787.a3103ff7.chunk.js" -> "static/js/787.a3103ff7.chunk.js" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_s3_object.object["3"] must be replaced
-/+ resource "aws_s3_object" "object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "js/787.a3103ff7.chunk.js.map" -> (known after apply)
      ~ key                    = "js/787.a3103ff7.chunk.js.map" -> "static/js/787.a3103ff7.chunk.js.map" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_s3_object.object["4"] must be replaced
-/+ resource "aws_s3_object" "object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "js/main.1af3e22d.js" -> (known after apply)
      ~ key                    = "js/main.1af3e22d.js" -> "static/js/main.1af3e22d.js" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_s3_object.object["5"] must be replaced
-/+ resource "aws_s3_object" "object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "js/main.1af3e22d.js.LICENSE.txt" -> (known after apply)
      ~ key                    = "js/main.1af3e22d.js.LICENSE.txt" -> "static/js/main.1af3e22d.js.LICENSE.txt" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_s3_object.object["6"] must be replaced
-/+ resource "aws_s3_object" "object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "js/main.1af3e22d.js.map" -> (known after apply)
      ~ key                    = "js/main.1af3e22d.js.map" -> "static/js/main.1af3e22d.js.map" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_s3_object.object["7"] must be replaced
-/+ resource "aws_s3_object" "object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg" -> (known after apply)
      ~ key                    = "media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg" -> "static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 8 to add, 0 to change, 8 to destroy.

```

</details>

*Pushed by: @roguecomp, Action: `pull_request`*